; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	thermograph0 - mode
	image1 - mode
	infrared2 - mode
	Star2 - direction
	GroundStation3 - direction
	Star0 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 infrared2)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 thermograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 image1)
	(calibration_target instrument4 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star2)
	(supports instrument6 image1)
	(supports instrument6 infrared2)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument8 thermograph0)
	(supports instrument8 infrared2)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation1)
	(supports instrument9 image1)
	(supports instrument9 thermograph0)
	(supports instrument9 infrared2)
	(calibration_target instrument9 Star0)
	(supports instrument10 thermograph0)
	(supports instrument10 infrared2)
	(supports instrument10 image1)
	(calibration_target instrument10 GroundStation3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
	(supports instrument11 thermograph0)
	(supports instrument11 infrared2)
	(calibration_target instrument11 Star0)
	(supports instrument12 thermograph0)
	(calibration_target instrument12 GroundStation4)
	(supports instrument13 thermograph0)
	(calibration_target instrument13 GroundStation1)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(on_board instrument13 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation3)
)
(:goal (and
	(pointing satellite1 Star5)
	(pointing satellite2 GroundStation4)
	(pointing satellite3 Phenomenon9)
	(pointing satellite4 Planet8)
	(have_image Star5 thermograph0)
	(have_image Star6 image1)
	(have_image Star7 thermograph0)
	(have_image Planet8 infrared2)
	(have_image Phenomenon9 infrared2)
	(have_image Phenomenon10 thermograph0)
	(have_image Phenomenon11 thermograph0)
	(have_image Planet12 image1)
))

)

; plan
1. (switch_on instrument9 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument9)
   goals met: 1 of 12
2. (calibrate satellite3 instrument9 star0)
   added: (calibrated instrument9)
   goals met: 1 of 12
3. (turn_to satellite3 star5 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 star5)
   goals met: 1 of 12
4. (take_image satellite3 star5 instrument9 thermograph0)
   added: (have_image star5 thermograph0)
   goals met: 2 of 12
5. (turn_to satellite3 planet8 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 planet8)
   goals met: 2 of 12
6. (take_image satellite3 planet8 instrument9 infrared2)
   added: (have_image planet8 infrared2)
   goals met: 3 of 12
7. (turn_to satellite3 planet12 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 planet12)
   goals met: 3 of 12
8. (take_image satellite3 planet12 instrument9 image1)
   added: (have_image planet12 image1)
   goals met: 4 of 12
9. (turn_to satellite3 phenomenon11 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 phenomenon11)
   goals met: 4 of 12
10. (take_image satellite3 phenomenon11 instrument9 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 5 of 12
11. (turn_to satellite3 phenomenon10 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 phenomenon10)
   goals met: 5 of 12
12. (turn_to satellite1 star5 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star5)
   goals met: 6 of 12
13. (take_image satellite3 phenomenon10 instrument9 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 7 of 12
14. (turn_to satellite3 star6 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 star6)
   goals met: 7 of 12
15. (take_image satellite3 star6 instrument9 image1)
   added: (have_image star6 image1)
   goals met: 8 of 12
16. (turn_to satellite3 star7 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 star7)
   goals met: 8 of 12
17. (take_image satellite3 star7 instrument9 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 9 of 12
18. (turn_to satellite3 phenomenon9 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 phenomenon9)
   goals met: 10 of 12
19. (take_image satellite3 phenomenon9 instrument9 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 11 of 12
20. (turn_to satellite4 planet8 groundstation3)
   deleted: (pointing satellite4 groundstation3)
   added: (pointing satellite4 planet8)
   goals met: 12 of 12
